<template>
  <div class="about_wrapper">
    <h1 class="white">
      «Риса за Аниме» — сообщество любителей аниме и критиков.
    </h1>
    <p class="white">
      С 2023 года мы делаем обзоры и рецензии на аниме всех жанров, составляем
      рейтинги сериалов и фильмов, формируем плейлисты и проводим премии. Мы
      предоставляем ценную обратную связь авторам аниме и открываем новую
      глубину восприятия аниме для всех поколений зрителей. Основатель РЗА и
      ведущий прямых трансляций — Кереешка Прайм. Опытный аниме-критик и
      энтузиаст с 2015 года. Создатель уникальной системы оценивания аниме и
      авторской шкалы ценности аниме-сериалов и фильмов.
    </p>
  </div>
</template>
<script setup></script>
<style scoped>
.white {
  color: white;
}
.about_wrapper {
  display: flex;
  flex-direction: column;
  max-width: 1000px;
  width: 100%;
  gap: 50px;
}
</style>
