<template>
  <div class="wrapper_faq">
    <h1 class="white">Часто задаваемые вопросы</h1>
    <p class="white">Здесь собраны ответы на часто задаваемые вопросы.</p>
    <div class="accordion">
      <div v-for="(item, index) in items" :key="index" class="border-b">
        <h3 class="flex">
          <div class="item" @click="toggle(index)">
            {{ item.title }}
            <svg
              xmlns="http://www.w3.org/2000/svg"
              width="24"
              height="24"
              viewBox="0 0 24 24"
              fill="#FFFFFF"
              stroke="currentColor"
              stroke-width="2"
              stroke-linecap="round"
              stroke-linejoin="round"
              class="svg"
              :class="{ 'rotate-180': item.isOpen }"
            >
              <path d="m6 9 6 6 6-6"></path>
            </svg>
          </div>
        </h3>
        <transition name="slide">
          <div v-show="item.isOpen" class="text_wrapper">
            <p class="text">{{ item.content }}</p>
          </div>
        </transition>
      </div>
    </div>
  </div>
</template>

<script setup>
import { ref } from "vue";

const items = ref([
  {
    title: "Что это за сайт? Где я?",
    content:
      "risazaanime.com — это площадка сообщества «Риса за Аниме», объединяющая любителей аниме и создателей контента. Здесь пользователи могут обсуждать аниме, оставлять рецензии и получать обратную связь от других участников сообщества.",
    isOpen: false,
  },
  {
    title: "Что такое «Риса за Аниме»?",
    content: `«Риса за Аниме» — это сообщество любителей аниме и критиков, основанное в 2023 году.  Это обзоры и рецензии на аниме всех жанров, рейтинги сериалов и фильмов, плейлисты и премии. Мы предоставляем авторам аниме заслуженное признание («рису») за их творчество в виде ценной обратной связи и открываем новую глубину восприятия аниме для всех поколений зрителей.Основатель сообщества и ведущий прямых трансляций — [Ваше Имя]. Опытный аниме-критик и энтузиаст с 2015 года. Создатель уникальной системы оценивания аниме и шкалы ценности аниме-сериалов и фильмов.Присоединяйтесь к «Рисе за Аниме» и участвуйте в обсуждениях, рецензиях и активной жизни сообщества!`,
    isOpen: false,
  },
  {
    title: "Цель «Риса за Аниме»",
    content: `В создании ценностей, объединяющих любителей аниме.

Главная проблема во взаимодействии людей — это невозможность понять ценности другого. Представители разных жанров аниме часто критикуют другие стили и направления, но полноценная кооперация между людьми и достижение взаимного счастья начинаются тогда, когда они способны понять ценности друг друга — конкретный фундамент, на базе которого зиждется любовь человека к определённому аспекту аниме.

Если проще, то людей интересует ответ на вопрос — по каким причинам то или иное аниме действительно интересно и ценно? Если ещё проще — за что это можно полюбить?

Тут и появляется «Риса за Аниме» с функцией «раскрытия и донесения». Мы создаём мостик, помогающий понять ответы на эти вопросы.

Теперь рецензии тысяч людей с развернутыми противоположными мнениями позволяют ответить себе на вопрос: «почему это понравилось?» или «почему не понравилось?».

Но чтобы быть понятыми, эмоции, чувства и смыслы должны быть оформлены в удобоваримую и ёмкую форму (не у всех есть время смотреть многочасовые разборы и читать все рецензии). Для этого у нас существуют контейнеры, способные ёмко выражать суть.

К примеру, рейтинги аниме по различным критериям — это созданная «Рисой за Аниме» ценность, доносящая до человека идею о степени качества аниме. Удобно, что при необходимости всегда можно посмотреть и почитать аргументацию.

Или система оценок, где люди обрамляют в понятную форму свои чувства и мысли, разбирая аниме на составляющие и приправляя их личными эмоциями и выводами.

Мы стараемся показывать прекрасное и объяснять, почему мы так думаем.

Наша цель — дать совокупность конструктивных субъективных мнений и форм, дающую на выходе сбалансированное представление о такой ценности другого человека, как «его любимое аниме».

Поняв ценность другого человека, вы сможете понять и его самого, а на базе взаимного понимания вы сможете прийти к формам кооперации, дающим нам новый лучший мир.

Для этого и существует сообщество «Риса за Аниме».`,
    isOpen: false,
  },
  {
    title: "Как релизы попадают на сайт?",
    content: `Релизы добавляются на сайт в трёх случаях:

Релиз разобран на стримах RZA, проходящих на Twitch:
Стрим новинок — релизы по запросу сообщества из голосований в Telegram-чате и голосований в Telegram-канале «Риса за Аниме».
Стрим «Фрешсет» — донатные разборы, где отбираются новые аниме для ежемесячной премии. Подробности по ссылке.
По запросу сообщества «Риса за Аниме», сформированному на дистанции в комментариях к разборам на YouTube, в чатах в Telegram и на Twitch.
Пользователи с ролью «Медиа» самостоятельно добавляют на сайт релизы в количестве «1 пользователь добавляет 1 релиз в месяц».
ВАЖНО: Призыв авторов спамить в чатах «Разберите Имя–Релиз» и возникший в этой связи единоразовый наплыв спама не является запросом, а является поводом к игнорированию релиза за неуважение членов сообщества.`,
    isOpen: false,
  },
]);

function toggle(index) {
  items.value[index].isOpen = !items.value[index].isOpen;
}
</script>

<style scoped>
.white {
  color: white;
  width: 100%;
  text-align: center;
}
.wrapper_faq {
  display: flex;
  flex-direction: column;
  gap: 20px;
  width: 100%;
  justify-content: center;
  align-items: center;
}
.accordion {
  display: flex;
  flex-direction: column;
  width: 100%;
  max-width: 800px;
}
.border-b {
  border-bottom: 1px solid #ccc;
}
.item {
  color: white;
  font-weight: 300;
  padding: 20px;
  user-select: none;
  cursor: pointer;
  transition: all 0.3s;
  text-align: left;
  display: flex;
  justify-content: space-between;
}
.rotate-180 {
  transform: rotate(180deg) translateY(2px);
}
.svg {
  transition: transform 0.2s ease;
  display: flex;
  justify-content: center;
  align-items: center;
}
.text {
  color: white;
  text-align: left;
}
.text_wrapper {
  padding: 20px 20px;
  overflow: hidden;
}
</style>
